OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/multiphase/interFoam/laminar/sloshingCylinder/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

mkdir -p constant/triSurface

cp -f \
    "$FOAM_TUTORIALS"/resources/geometry/sloshingCylinder.obj.gz \
    constant/triSurface/

restore0Dir

runApplication blockMesh

runApplication snappyHexMesh -overwrite

runApplication setFields

#------------------------------------------------------------------------------
